Перем Ожидаем;
Перем Утверждения;
Перем ГенераторТестовыхДанных;


#Область Стандартный_интерфейс

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	
	КонтекстЯдра 			= КонтекстЯдраПараметр;
	Утверждения 			= КонтекстЯдра.Плагин("БазовыеУтверждения");
	ГенераторТестовыхДанных = КонтекстЯдра.Плагин("СериализаторMXL");
	
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	НаборТестов.Добавить("Тест_Проверить_СозданиеТелевизионнаяСетка");
КонецПроцедуры

Процедура ПередЗапускомТеста() Экспорт 
	НачатьТранзакцию();
КонецПроцедуры 

Процедура ПослеЗапускаТеста() Экспорт 
	
	Если ТранзакцияАктивна() Тогда
		ОтменитьТранзакцию();
	КонецЕсли; 
	
КонецПроцедуры 

#КонецОбласти

#Область Тесты


// Сам тест
Процедура Тест_Проверить_СозданиеТелевизионнаяСетка() Экспорт
	
	ТестовыеДанные = ГенераторТестовыхДанных.СоздатьДанныеПоМакетам(ЭтотОбъект, "ТестовыеДанные");
	Утверждения.ПроверитьТип(ТестовыеДанные, "Структура");
	//Ожидаем.Что(РежимПроверен, ТекстОшибки).ЕстьИстина();

КонецПроцедуры



#КонецОбласти