Перем Ожидаем;
Перем Утверждения;
Перем ГенераторТестовыхДанных;


#Область Стандартный_интерфейс

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	
	КонтекстЯдра = КонтекстЯдраПараметр;
	Ожидаем = КонтекстЯдра.Плагин("УтвержденияBDD");
	
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	НаборТестов.Добавить("Тест_Проверить_МетодСоздаетВТПоказыВМВТ");
КонецПроцедуры

Процедура ПередЗапускомТеста() Экспорт 
	НачатьТранзакцию();
КонецПроцедуры 

Процедура ПослеЗапускаТеста() Экспорт 
	
	Если ТранзакцияАктивна() Тогда
		ОтменитьТранзакцию();
	КонецЕсли; 
	
КонецПроцедуры 

#КонецОбласти

#Область Тесты

// Сам тест
Процедура Тест_Проверить_МетодСоздаетВТПоказыВМВТ() Экспорт
		
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("НачалоПериода", 	НачалоГода(ТекущаяДатаСеанса()));
	ПараметрыОтбора.Вставить("КонецПериода", 	КонецГода(ТекущаяДатаСеанса()));
	ПараметрыОтбора.Вставить("Уровень", 		ПредопределенноеЗначение("Справочник.слм_УровниСетки.Среднесрочная"));
	ПараметрыОтбора.Вставить("Канал",			ПредопределенноеЗначение("Справочник.слм_ТелевизионныеКаналы.НовыйКанал"));
	ПараметрыОтбора.Вставить("Телесмещение",   	слм_РаботаСТелевременемКлиентСерверПовтИсп.Телесмещение());	
	
	ТестируемыйМВТ = Новый МенеджерВременныхТаблиц;
	
	ИмяВТПоказы = "ВТ_Показы";
	
	РегистрыСведений.слм_РезервыПоказов.СоздатьВТПоказы(ПараметрыОтбора,ТестируемыйМВТ,ИмяВТПоказы);
	
	Ожидаем.Что(ТестируемыйМВТ).ИмеетТип("МенеджерВременныхТаблиц");
	Ожидаем.Что(ТестируемыйМВТ.Таблицы.Найти(ИмяВТПоказы)).Не_().ЭтоНеопределено();
	Ожидаем.Что(ТестируемыйМВТ.Таблицы.Найти(ИмяВТПоказы).Колонки.Найти("Лицензия")).Не_().ЭтоНеопределено();
	
	ТестируемыйМВТ.Закрыть();
		
КонецПроцедуры


#КонецОбласти